In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import plotly.express as exp
import seaborn as srn

In [3]:
# Run this cell so pandas displays all columns
pd.set_option('display.max_columns', None)

In [4]:
df_companies = pd.read_csv("../data/raw/Modified_Unicorn_Companies.csv")

In [5]:
df_companies.head()

,Company,Valuation,Date Joined,Industry,City,Country/Region,Continent,Year Founded,Funding,Select Investors
0,Bytedance,180,2017-04-07,Artificial intelligence,Beijing,China,Asia,2012,$8B,"Sequoia Capital China, SIG Asia Investments, S..."
1,SpaceX,100,2012-12-01,Other,Hawthorne,United States,North America,2002,$7B,"Founders Fund, Draper Fisher Jurvetson, Rothen..."
2,SHEIN,100,2018-07-03,E-commerce & direct-to-consumer,Shenzhen,China,Asia,2008,$2B,"Tiger Global Management, Sequoia Capital China..."
3,Stripe,95,2014-01-23,FinTech,San Francisco,United States,North America,2010,$2B,"Khosla Ventures, LowercaseCapital, capitalG"
4,Klarna,46,2011-12-12,Fintech,Stockholm,Sweden,Europe,2005,$4B,"Institutional Venture Partners, Sequoia Capita..."

In [6]:
# Display the data types of the columns.
df_companies.dtypes

Company             object
Valuation            int64
Date Joined         object
Industry            object
City                object
Country/Region      object
Continent           object
Year Founded         int64
Funding             object
Select Investors    object
dtype: object

In [7]:
df_companies['Date Joined'] = pd.to_datetime(df_companies['Date Joined'])

In [8]:
df_companies.dtypes

Company                     object
Valuation                    int64
Date Joined         datetime64[ns]
Industry                    object
City                        object
Country/Region              object
Continent                   object
Year Founded                 int64
Funding                     object
Select Investors            object
dtype: object

In [9]:
df_companies['Year Joined'] = df_companies['Date Joined'].dt.year

df_companies['Years To Unicorn'] = df_companies['Year Joined'] - df_companies['Year Founded'] 
df_companies.head()

,Company,Valuation,Date Joined,Industry,City,Country/Region,Continent,Year Founded,Funding,Select Investors,Year Joined,Years To Unicorn
0,Bytedance,180,2017-04-07,Artificial intelligence,Beijing,China,Asia,2012,$8B,"Sequoia Capital China, SIG Asia Investments, S...",2017,5
1,SpaceX,100,2012-12-01,Other,Hawthorne,United States,North America,2002,$7B,"Founders Fund, Draper Fisher Jurvetson, Rothen...",2012,10
2,SHEIN,100,2018-07-03,E-commerce & direct-to-consumer,Shenzhen,China,Asia,2008,$2B,"Tiger Global Management, Sequoia Capital China...",2018,10
3,Stripe,95,2014-01-23,FinTech,San Francisco,United States,North America,2010,$2B,"Khosla Ventures, LowercaseCapital, capitalG",2014,4
4,Klarna,46,2011-12-12,Fintech,Stockholm,Sweden,Europe,2005,$4B,"Institutional Venture Partners, Sequoia Capita...",2011,6

In [10]:
df_companies.describe()

,Valuation,Date Joined,Year Founded,Year Joined,Years To Unicorn
count,1074.000000,1074,1074.000000,1074.000000,1074.000000
mean,3.445996,2020-05-14 20:22:47.597765376,2012.870577,2019.883613,7.013035
min,1.000000,2007-07-02 00:00:00,1919.000000,2007.000000,-3.000000
25%,1.000000,2019-05-15 06:00:00,2011.000000,2019.000000,4.000000
50%,2.000000,2021-03-26 00:00:00,2014.000000,2021.000000,6.000000
75%,3.000000,2021-09-16 00:00:00,2016.000000,2021.000000,9.000000
max,180.000000,2022-04-05 00:00:00,2021.000000,2022.000000,98.000000
std,8.544242,NaN,5.705494,2.008011,5.331842

In [11]:
negative_years_df = df_companies[df_companies['Years To Unicorn'] < 0]
df_companies.describe()

,Valuation,Date Joined,Year Founded,Year Joined,Years To Unicorn
count,1074.000000,1074,1074.000000,1074.000000,1074.000000
mean,3.445996,2020-05-14 20:22:47.597765376,2012.870577,2019.883613,7.013035
min,1.000000,2007-07-02 00:00:00,1919.000000,2007.000000,-3.000000
25%,1.000000,2019-05-15 06:00:00,2011.000000,2019.000000,4.000000
50%,2.000000,2021-03-26 00:00:00,2014.000000,2021.000000,6.000000
75%,3.000000,2021-09-16 00:00:00,2016.000000,2021.000000,9.000000
max,180.000000,2022-04-05 00:00:00,2021.000000,2022.000000,98.000000
std,8.544242,NaN,5.705494,2.008011,5.331842

In [12]:
df_companies[df_companies['Years To Unicorn'] < 0]

,Company,Valuation,Date Joined,Industry,City,Country/Region,Continent,Year Founded,Funding,Select Investors,Year Joined,Years To Unicorn
527,InVision,2,2017-11-01,Internet software & services,New York,United States,North America,2020,$349M,"FirstMark Capital, Tiger Global Management, IC...",2017,-3

In [13]:
df_companies.loc[df_companies['Company']=='InVision', 'Year Founded'] = 2011
df_companies[df_companies['Company'] == "InVision"]

,Company,Valuation,Date Joined,Industry,City,Country/Region,Continent,Year Founded,Funding,Select Investors,Year Joined,Years To Unicorn
527,InVision,2,2017-11-01,Internet software & services,New York,United States,North America,2011,$349M,"FirstMark Capital, Tiger Global Management, IC...",2017,-3

In [15]:
df_companies.loc[df_companies['Company'] == 'InVision', 'Year Founded'] = 2011

In [16]:
df_companies.head()

,Company,Valuation,Date Joined,Industry,City,Country/Region,Continent,Year Founded,Funding,Select Investors,Year Joined,Years To Unicorn
0,Bytedance,180,2017-04-07,Artificial intelligence,Beijing,China,Asia,2012,$8B,"Sequoia Capital China, SIG Asia Investments, S...",2017,5
1,SpaceX,100,2012-12-01,Other,Hawthorne,United States,North America,2002,$7B,"Founders Fund, Draper Fisher Jurvetson, Rothen...",2012,10
2,SHEIN,100,2018-07-03,E-commerce & direct-to-consumer,Shenzhen,China,Asia,2008,$2B,"Tiger Global Management, Sequoia Capital China...",2018,10
3,Stripe,95,2014-01-23,FinTech,San Francisco,United States,North America,2010,$2B,"Khosla Ventures, LowercaseCapital, capitalG",2014,4
4,Klarna,46,2011-12-12,Fintech,Stockholm,Sweden,Europe,2005,$4B,"Institutional Venture Partners, Sequoia Capita...",2011,6